---
kind: property
id: P:Autodesk.Revit.DB.ConicalSurface.XDir
source: html/9f38585d-9ab8-5f41-7713-14f7acd5760e.htm
---
# Autodesk.Revit.DB.ConicalSurface.XDir Property

X axis of the local coordinate system associated with this cone.

## Syntax (C#)
```csharp
public XYZ XDir { get; }
```